fpistm/Arduino_Core_STM32L4/cores/arduino/libstm32l4/timer.c
/**
  ******************************************************************************
  * @file    timer.c
  * @author  WI6LABS
  * @version V1.0.0
  * @date    07-March-2016
  * @brief   provide timer services
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2015 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/** @addtogroup CMSIS
  * @{
  */

/** @addtogroup stm32l4xx_system
  * @{
  */

/** @addtogroup STM32L4xx_System_Private_Includes
  * @{
  */
#include "stm32l4xx.h"
#include "hw_config.h"
#include "timer.h"
#include "digital_io.h"
#include "clock.h"
#include "analog.h"

#ifdef __cplusplus
 extern "C" {
#endif

/**
  * @}
  */

/** @addtogroup STM32L4xx_System_Private_TypesDefinitions
  * @{
  */

/**
  * @}
  */

/** @addtogroup STM32L4xx_System_Private_Defines
  * @{
  */

/**
  * @}
  */
  
/** @addtogroup STM32L4xx_System_Private_FunctionPrototypes
* @{
*/

static void HAL_TIMx_PeriodElapsedCallback(timer_id_e timer_id);
static timer_id_e get_timer_id_from_handle(TIM_HandleTypeDef *htim);

/**
  * @}
  */

/** @addtogroup STM32L4xx_System_Private_Macros
  * @{
  */

static void tim1_clock_enable(void)   { __TIM1_CLK_ENABLE(); }
static void tim1_clock_reset(void)    { __TIM1_CLK_DISABLE(); }
static void tim2_clock_enable(void)   { __TIM2_CLK_ENABLE(); }
static void tim2_clock_reset(void)    { __TIM2_CLK_DISABLE(); }
static void tim3_clock_enable(void)   { __TIM3_CLK_ENABLE(); }
static void tim3_clock_reset(void)    { __TIM3_CLK_DISABLE(); }
static void tim4_clock_enable(void)   { __TIM4_CLK_ENABLE(); }
static void tim4_clock_reset(void)    { __TIM4_CLK_DISABLE(); }
static void tim5_clock_enable(void)   { __TIM5_CLK_ENABLE(); }
static void tim5_clock_reset(void)    { __TIM5_CLK_DISABLE(); }
static void tim6_clock_enable(void)   { __TIM6_CLK_ENABLE(); }
static void tim6_clock_reset(void)    { __TIM6_CLK_DISABLE(); }
static void tim7_clock_enable(void)   { __TIM7_CLK_ENABLE(); }
static void tim7_clock_reset(void)    { __TIM7_CLK_DISABLE(); }
static void tim8_clock_enable(void)   { __TIM8_CLK_ENABLE(); }
static void tim8_clock_reset(void)    { __TIM8_CLK_DISABLE(); }
static void tim15_clock_enable(void)  { __TIM15_CLK_ENABLE(); }
static void tim15_clock_reset(void)   { __TIM15_CLK_DISABLE(); }
static void tim16_clock_enable(void)  { __TIM16_CLK_ENABLE(); }
static void tim16_clock_reset(void)   { __TIM16_CLK_DISABLE(); }
static void tim17_clock_enable(void)  { __TIM17_CLK_ENABLE(); }
static void tim17_clock_reset(void)   { __TIM17_CLK_DISABLE(); }

static void tim5_irqHandle(timer_id_e timer_id)   { HAL_TIM5_PeriodElapsedCallback(); }

/**
  * @}
  */

/** @addtogroup STM32L4xx_System_Private_Variables
  * @{
  */
  
/// @brief timer caracteristics
extern analog_config_str g_analog_config[NB_ANALOG_CHANNELS];

static TIM_HandleTypeDef g_TimerHandle[NB_TIMER_MANAGED];

static timer_conf_t g_timer_config[NB_TIMER_MANAGED] = {
  {
    //TIMER ID and IRQ
    .timInstance = TIM1, .irqtype = TIM1_UP_TIM16_IRQn,
    .irqHandle = NULL,
    .irqHandleOC = NULL,
    .timer_mode = TIMER_PWM,
    //timer clock init
    .timer_clock_init = tim1_clock_enable,
    //timer clock reset
    .timer_clock_reset = tim1_clock_reset,
    //timer prescaler limit : 8 or 16 bits
    .prescalerLimit = bits_16,
    //toggle pin configuration
    .toggle_pin = { .port = NULL },
    .configured = 0
  },
  {
    //TIMER ID and IRQ
    .timInstance = TIM2, .irqtype = TIM2_IRQn,
    .irqHandle = NULL,
    .irqHandleOC = NULL,
    .timer_mode = TIMER_PWM,
    //timer clock init
    .timer_clock_init = tim2_clock_enable,
    //timer clock reset
    .timer_clock_reset = tim2_clock_reset,
    //timer prescaler limit : 8 or 16 bits
    .prescalerLimit = bits_16,
    //toggle pin configuration
    .toggle_pin = { .port = NULL },
    .configured = 0
  },
  {
    //TIMER ID and IRQ
    .timInstance = TIM3, .irqtype = TIM3_IRQn,
    .irqHandle = NULL,
    .irqHandleOC = NULL,
    .timer_mode = TIMER_PWM,
    //timer clock init
    .timer_clock_init = tim3_clock_enable,
    //timer clock reset
    .timer_clock_reset = tim3_clock_reset,
    //timer prescaler limit : 8 or 16 bits
    .prescalerLimit = bits_16,
    //toggle pin configuration
    .toggle_pin = { .port = NULL },
    .configured = 0
  },
  {
    //TIMER ID and IRQ
    .timInstance = TIM4, .irqtype = TIM4_IRQn,
    .irqHandle = NULL,
    .irqHandleOC = NULL,
    .timer_mode = TIMER_PWM,
    //timer clock init
    .timer_clock_init = tim4_clock_enable,
    //timer clock reset
    .timer_clock_reset = tim4_clock_reset,
    //timer prescaler limit : 8 or 16 bits
    .prescalerLimit = bits_16,
    //toggle pin configuration
    .toggle_pin = { .port = NULL },
    .configured = 0
  },
  //TIMER 5 : DON'T USE!!! IT IS USED FOR THE CLOCK!!!
  {
    //TIMER ID and IRQ
    .timInstance = TIM5, .irqtype = TIM5_IRQn,
    .irqHandle = tim5_irqHandle,
    .irqHandleOC = NULL,
    .timer_mode = TIMER_RESERVED,
    //timer clock init
    .timer_clock_init = tim5_clock_enable,
    //timer clock reset
    .timer_clock_reset = tim5_clock_reset,
    //timer prescaler limit : 8 or 16 bits
    .prescalerLimit = bits_16,
    //toggle pin configuration
    .toggle_pin = { .port = NULL },
    .configured = 0
  },
  {
    //TIMER ID and IRQ
    .timInstance = TIM6, .irqtype = TIM6_DAC_IRQn,
    .irqHandle = HAL_TIMx_PeriodElapsedCallback,
    .irqHandleOC = NULL,
    .timer_mode = TIMER_OTHER,
    //timer clock init
    .timer_clock_init = tim6_clock_enable,
    //timer clock reset
    .timer_clock_reset = tim6_clock_reset,
    //timer prescaler limit : 8 or 16 bits
    .prescalerLimit = bits_16,
    //toggle pin configuration
    .toggle_pin = { .port = NULL },
    .configured = 0
  },
  {
    //TIMER ID and IRQ
    .timInstance = TIM7, .irqtype = TIM7_IRQn,
    .irqHandle = HAL_TIMx_PeriodElapsedCallback,
    .irqHandleOC = NULL,
    .timer_mode = TIMER_OTHER,
    //timer clock init
    .timer_clock_init = tim7_clock_enable,
    //timer clock reset
    .timer_clock_reset = tim7_clock_reset,
    //timer prescaler limit : 8 or 16 bits
    .prescalerLimit = bits_16,
    //toggle pin configuration
    .toggle_pin = { .port = NULL },
    .configured = 0
  },
  {
    //TIMER ID and IRQ
    .timInstance = TIM8, .irqtype = TIM8_UP_IRQn,
    .irqHandle = HAL_TIMx_PeriodElapsedCallback,
    .irqHandleOC = NULL,
    .timer_mode = TIMER_OTHER,
    //timer clock init
    .timer_clock_init = tim8_clock_enable,
    //timer clock reset
    .timer_clock_reset = tim8_clock_reset,
    //timer prescaler limit : 8 or 16 bits
    .prescalerLimit = bits_16,
    //toggle pin configuration
    .toggle_pin = { .port = NULL },
    .configured = 0
  },
  {
    //TIMER ID and IRQ
    .timInstance = TIM15, .irqtype = TIM1_BRK_TIM15_IRQn,
    .irqHandle = HAL_TIMx_PeriodElapsedCallback,
    .irqHandleOC = NULL,
    .timer_mode = TIMER_OTHER,
    //timer clock init
    .timer_clock_init = tim15_clock_enable,
    //timer clock reset
    .timer_clock_reset = tim15_clock_reset,
    //timer prescaler limit : 8 or 16 bits
    .prescalerLimit = bits_16,
    //toggle pin configuration
    .toggle_pin = { .port = NULL },
    .configured = 0
  },
  {
    //TIMER ID and IRQ
    .timInstance = TIM16, .irqtype = TIM1_UP_TIM16_IRQn,
    .irqHandle = HAL_TIMx_PeriodElapsedCallback,
    .irqHandleOC = NULL,
    .timer_mode = TIMER_OTHER,
    //timer clock init
    .timer_clock_init = tim16_clock_enable,
    //timer clock reset
    .timer_clock_reset = tim16_clock_reset,
    //timer prescaler limit : 8 or 16 bits
    .prescalerLimit = bits_16,
    //toggle pin configuration
    .toggle_pin = { .port = NULL },
    .configured = 0
  },
  {
    //TIMER ID and IRQ
    .timInstance = TIM17, .irqtype = TIM1_TRG_COM_TIM17_IRQn,
    .irqHandle = NULL,
    .irqHandleOC = NULL,
    .timer_mode = TIMER_OTHER,
    //timer clock init
    .timer_clock_init = tim17_clock_enable,
    //timer clock reset
    .timer_clock_reset = tim17_clock_reset,
    //timer prescaler limit : 8 or 16 bits
    .prescalerLimit = bits_16,
    //toggle pin configuration
    .toggle_pin = { .port = NULL },
    .configured = 0
  }
};


/**
  * @}
  */
  
/**
  * @brief  This function returns the corresponding timer id function of the
  *         handle
  * @param  htim : one of the defined
  * @retval the TIMx id
  */
timer_id_e get_timer_id_from_handle(TIM_HandleTypeDef *htim)
{
  timer_id_e timer_id = NB_TIMER_MANAGED;
  uint8_t i;
  for(i = 0; i<NB_TIMER_MANAGED; i++) {
    if(&g_TimerHandle[i] == htim) {
      timer_id = i;
      break;
    }
  }
  return timer_id;
}

/**
  * @brief  Enable the timer clock
  * @param  htim : one of the defined timer
  * @retval None
  */
void timer_enable_clock(TIM_HandleTypeDef *htim)
{
  uint8_t i = 0;
  for(i = 0; i < NB_TIMER_MANAGED; i++) {
    if(g_timer_config[i].timInstance == htim->Instance) {
      g_timer_config[i].timer_clock_init();
      g_timer_config[i].configured = 1;
      break;
    }
  }
}

/**
  * @brief  Disable the timer clock
  * @param  htim : one of the defined timer
  * @retval None
  */
void timer_disable_clock(TIM_HandleTypeDef *htim)
{
  uint8_t i = 0;
  for(i = 0; i < NB_TIMER_MANAGED; i++) {
    if(g_timer_config[i].timInstance == htim->Instance) {
      g_timer_config[i].timer_clock_reset();
      g_timer_config[i].configured = 0;
      break;
    }
  }
}

/**
  * @brief  Find the first timer not used
  * @param  none
  * @retval The id of the first timer not used if not the number of id.
  */
timer_id_e getInactiveTimer(void)
{
  timer_id_e timer_id = NB_TIMER_MANAGED;
  uint8_t i = 0;
  for(i = 0; i < NB_TIMER_MANAGED; i++) {
    if((g_timer_config[i].configured == 0) &&
       (g_timer_config[i].timer_mode == TIMER_OTHER)){
      timer_id = i;
      break;
    }
  }
  
  return timer_id;
}

/**
  * @brief  Search the timer associate to a pin
  * @param  port : port pointer
  * @param  pin : pin number
  * @retval The timer id
  */
timer_id_e isPinAssociateToTimer(GPIO_TypeDef *port, uint32_t pin)
{
  uint8_t i = 0;
  timer_id_e timer_id = NB_TIMER_MANAGED;
  
  for(i = 0; i < NB_TIMER_MANAGED; i++) {
    if((g_timer_config[i].toggle_pin.port == port) &&
       (g_timer_config[i].toggle_pin.pin == pin))  {
       timer_id = i;
       break;
    }
  }
  
  return timer_id;
}

/**
  * @brief TIM5 MSP Initialization
  *        This function configures the hardware resources used in this example:
  *           - Peripheral's clock enable
  *           - Peripheral's GPIO Configuration
  * @param  None
  * @retval None
  */
static void HAL_TIM5_Base_MspInit(void)
{
  /*##-1- Enable peripherals and GPIO Clocks #################################*/
  /* TIMx Peripheral clock enable */
  __HAL_RCC_TIM5_CLK_ENABLE();

