fpistm/Arduino_Core_STM32L4/cores/arduino/libstm32l4/timer.c
  /*##-2- Configure the NVIC for TIMx ########################################*/
  /* Set the TIMx priority */
  HAL_NVIC_SetPriority(g_timer_config[TIM5_E].irqtype, 3, 0);

  /* Enable the TIMx global Interrupt */
  HAL_NVIC_EnableIRQ(g_timer_config[TIM5_E].irqtype);
}
  
/**
  * @brief  TIMER Initialization - clock init and nvic init
  * @param  htim_base : one of the defined timer
  * @retval None
  */
void HAL_TIM_Base_MspInit(TIM_HandleTypeDef *htim_base)
{
  timer_id_e timer_id;

  timer_id = get_timer_id_from_handle(htim_base);
  if(NB_TIMER_MANAGED == timer_id) {
    return;
  }

  if(timer_id == TIM5_E) {
    HAL_TIM5_Base_MspInit();
  }
  else
  {
    timer_enable_clock(htim_base);

    HAL_NVIC_SetPriority(g_timer_config[timer_id].irqtype, 15 ,0);
    HAL_NVIC_EnableIRQ(g_timer_config[timer_id].irqtype);
  }
}

/**
  * @brief  TIMER Deinitialization - clock and nvic
  * @param  htim_base : one of the defined timer
  * @retval None
  */
void HAL_TIM_Base_MspDeInit(TIM_HandleTypeDef *htim_base)
{
  timer_id_e timer_id;

  timer_id = get_timer_id_from_handle(htim_base);
  if(NB_TIMER_MANAGED == timer_id) {
    return;
  }

  if(timer_id == TIM5_E) {}
  else {
    timer_disable_clock(htim_base);
    HAL_NVIC_DisableIRQ(g_timer_config[timer_id].irqtype);
  }
}

/**
  * @brief  This function will set the timer to the required value
  * @param  timer_id : timer_id_e
  * @param  period : Timer period in milliseconds
  * @param  prescaler : clock divider
  * @retval None
  */
void TimerHandleInit(timer_id_e timer_id, uint16_t period, uint16_t prescaler)
{
  if(timer_id >= NB_TIMER_MANAGED) return;
  
  g_TimerHandle[timer_id].Instance               = g_timer_config[timer_id].timInstance;
  g_TimerHandle[timer_id].Init.Period            = period;
  g_TimerHandle[timer_id].Init.Prescaler         = prescaler;
  g_TimerHandle[timer_id].Init.ClockDivision     = 0;
  g_TimerHandle[timer_id].Init.CounterMode       = TIM_COUNTERMODE_UP;
  g_TimerHandle[timer_id].Init.RepetitionCounter = 0;
  
  if(HAL_TIM_Base_Init(&g_TimerHandle[timer_id]) != HAL_OK){
    return;
  }

  if(HAL_TIM_Base_Start_IT(&g_TimerHandle[timer_id]) != HAL_OK);{
    return;
  }
}

/**
  * @brief  This function will reset the timer
  * @param  timer_id : timer_id_e
  * @retval None
  */
void TimerHandleDeinit(timer_id_e timer_id)
{
  HAL_TIM_Base_DeInit(&g_TimerHandle[timer_id]);
  HAL_TIM_Base_Stop_IT(&g_TimerHandle[timer_id]);
}

/**
  * @brief  This function will set the timer to generate pulse in interrupt mode with a particular duty cycle
  * @param  timer_id : timer_id_e
  * @param  period : timer period in microseconds
  * @param  pulseWidth : pulse width in microseconds
  * @param  irqHandle : interrupt routine to call
  * @retval None
  */
void TimerPulseInit(timer_id_e timer_id, uint16_t period, uint16_t pulseWidth, void (*irqHandle)(timer_id_e, uint32_t))
{
  TIM_OC_InitTypeDef sConfig;
  
  if(timer_id >= NB_TIMER_MANAGED) return; 
  if(g_timer_config[timer_id].configured == 1) return;
    
  
  //min pulse = 1us - max pulse = 65535us
  g_TimerHandle[timer_id].Instance               = g_timer_config[timer_id].timInstance;
  g_TimerHandle[timer_id].Init.Period            = period;
  g_TimerHandle[timer_id].Init.Prescaler         = (uint32_t)(HAL_RCC_GetHCLKFreq() / 1000000) - 1;
  g_TimerHandle[timer_id].Init.ClockDivision     = 0;
  g_TimerHandle[timer_id].Init.CounterMode       = TIM_COUNTERMODE_UP;
  g_TimerHandle[timer_id].Init.RepetitionCounter = 0;
  
  g_timer_config[timer_id].irqHandleOC = irqHandle;
  
  sConfig.OCMode = TIM_OCMODE_TIMING;
  sConfig.Pulse = pulseWidth; 
  
  if(HAL_TIM_OC_Init(&g_TimerHandle[timer_id]) != HAL_OK) return;
  
  if(HAL_TIM_OC_ConfigChannel(&g_TimerHandle[timer_id],&sConfig, TIM_CHANNEL_1) != HAL_OK) return;
  if(HAL_TIM_OC_Start_IT(&g_TimerHandle[timer_id], TIM_CHANNEL_1) != HAL_OK) return;
}

/**
  * @brief  This function will reset the pulse generation
  * @param  timer_id : timer_id_e
  * @retval None
  */
void TimerPulseDeinit(timer_id_e timer_id)
{
  if(timer_id >= NB_TIMER_MANAGED) return; 

  g_timer_config[timer_id].irqHandleOC = NULL;
  
  if(HAL_TIM_OC_DeInit(&g_TimerHandle[timer_id]) != HAL_OK) return;
  if(HAL_TIM_OC_Stop_IT(&g_TimerHandle[timer_id], TIM_CHANNEL_1) != HAL_OK) return;
}

/**
  * @brief  Initializes the TIM Output Compare MSP.
  * @param  htim: TIM handle
  * @retval None
  */
void HAL_TIM_OC_MspInit(TIM_HandleTypeDef *htim)
{
  timer_id_e timer_id;

  timer_id = get_timer_id_from_handle(htim);
  if(NB_TIMER_MANAGED == timer_id) {
    return;
  }
  
  timer_enable_clock(htim);
  HAL_NVIC_SetPriority(g_timer_config[timer_id].irqtype, 14 ,0);
  HAL_NVIC_EnableIRQ(g_timer_config[timer_id].irqtype);
}

/**
  * @brief  DeInitialize TIM Output Compare MSP.
  * @param  htim: TIM handle
  * @retval None
  */
void HAL_TIM_OC_MspDeInit(TIM_HandleTypeDef *htim)
{
  timer_id_e timer_id;

  timer_id = get_timer_id_from_handle(htim);
  if(NB_TIMER_MANAGED == timer_id) {
    return;
  }
  
  timer_disable_clock(htim);
  HAL_NVIC_DisableIRQ(g_timer_config[timer_id].irqtype);
}

/**
  * @brief  Output Compare callback in non-blocking mode
  * @param  htim : TIM OC handle
  * @retval None
  */
void HAL_TIM_OC_DelayElapsedCallback(TIM_HandleTypeDef *htim)
{
  uint32_t channel = 0;
  timer_id_e timer_id = get_timer_id_from_handle(htim);
  if(NB_TIMER_MANAGED == timer_id) {
    return;
  }
  
  if(g_timer_config[timer_id].irqHandleOC != NULL) {
    switch(htim->Channel) {
      case HAL_TIM_ACTIVE_CHANNEL_1:
        channel = TIM_CHANNEL_1 / 4;
      break;
      default:
        return;
      break;
    }
      g_timer_config[timer_id].irqHandleOC(timer_id, channel); 
  }
}

/**
  * @brief  Period elapsed callback in non-blocking mode
  * @param  timer_id : id of the timer
  * @retval None
  */
void HAL_TIMx_PeriodElapsedCallback(timer_id_e timer_id)
{
  if(g_timer_config[timer_id].toggle_pin.port != NULL) {
    if(g_timer_config[timer_id].toggle_pin.count > 0){
      g_timer_config[timer_id].toggle_pin.count--;
      
      if(g_timer_config[timer_id].toggle_pin.state == 0) {
        g_timer_config[timer_id].toggle_pin.state = 1;
        digital_io_write(g_timer_config[timer_id].toggle_pin.port, 
                         g_timer_config[timer_id].toggle_pin.pin, 1);
      }
      else {
        g_timer_config[timer_id].toggle_pin.state = 0;
        digital_io_write(g_timer_config[timer_id].toggle_pin.port, 
                         g_timer_config[timer_id].toggle_pin.pin, 0);
      }
    }
    else if(g_timer_config[timer_id].toggle_pin.count == -1) {
      if(g_timer_config[timer_id].toggle_pin.state == 0) {
        g_timer_config[timer_id].toggle_pin.state = 1;
        digital_io_write(g_timer_config[timer_id].toggle_pin.port, 
                         g_timer_config[timer_id].toggle_pin.pin, 1);
      }
      else {
        g_timer_config[timer_id].toggle_pin.state = 0;
        digital_io_write(g_timer_config[timer_id].toggle_pin.port, 
                         g_timer_config[timer_id].toggle_pin.pin, 0);
      }
    }
    else {
      digital_io_write(g_timer_config[timer_id].toggle_pin.port, 
                       g_timer_config[timer_id].toggle_pin.pin, 0);
    }
  }
}

/**
  * @brief  Period elapsed callback in non-blocking mode
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  timer_id_e timer_id = get_timer_id_from_handle(htim);
  if(NB_TIMER_MANAGED == timer_id) {
    return;
  }
  
