fpistm/Arduino_Core_STM32L4/cores/arduino/libstm32l4/timer.c
  if(g_timer_config[timer_id].irqHandle != NULL) {
      g_timer_config[timer_id].irqHandle(timer_id); 
  }
}

/**
  * @brief  This function will set the tone timer to the required value and 
  *         configure the pin to toggle.
  * @param  port : pointer to GPIO_TypeDef
  * @param  pin : pin number to toggle
  * @param  frequency : toggle frequency (in hertz)
  * @param  duration : toggle time
  * @retval None
  */
void TimerPinInit(GPIO_TypeDef *port, uint32_t pin, uint32_t frequency, uint32_t duration)
{
  uint8_t end = 0;
  uint32_t prescaler = 1;
  uint32_t period = 0;
  timer_id_e timer_id;
  
  timer_id = isPinAssociateToTimer(port,pin);
  
  if(timer_id == NB_TIMER_MANAGED) {
    timer_id = getInactiveTimer();
    if(timer_id == NB_TIMER_MANAGED)
      return;
  }
  
  if(frequency > MAX_FREQ)
    return;
  
  g_timer_config[timer_id].toggle_pin.port = port;
  g_timer_config[timer_id].toggle_pin.pin = pin;
  g_timer_config[timer_id].toggle_pin.state = 0;
  
  //Calculate the toggle count
  if (duration > 0) {
    g_timer_config[timer_id].toggle_pin.count = ((frequency * duration) / 1000) * 2;
  }
  else {
    g_timer_config[timer_id].toggle_pin.count = -1;
  }

  digital_io_init(port, pin, GPIO_MODE_OUTPUT_PP, GPIO_NOPULL);

  while(end == 0) {
    period = ((uint32_t)(HAL_RCC_GetHCLKFreq() / frequency / prescaler) / 2) - 1;
    
    if((period >= g_timer_config[timer_id].prescalerLimit)
        && (prescaler < g_timer_config[timer_id].prescalerLimit))
      prescaler++; //prescaler *= 2;
    else
      end = 1;
  }
  
  if((period < g_timer_config[timer_id].prescalerLimit) 
      && (prescaler < g_timer_config[timer_id].prescalerLimit)) {
    g_timer_config[timer_id].irqHandle = HAL_TIMx_PeriodElapsedCallback;
    TimerHandleInit(timer_id, period, prescaler-1);
  }
  else {
    TimerHandleDeinit(timer_id);
  }
}

/**
  * @brief  This function will reset the tone timer
  * @param  port : pointer to port
  * @param  pin : pin number to toggle
  * @retval None
  */
void TimerPinDeinit(GPIO_TypeDef *port, uint32_t pin)
{
  timer_id_e timer_id = isPinAssociateToTimer(port,pin);
  
  if(timer_id < NB_TIMER_MANAGED) {
    TimerHandleDeinit(timer_id);
    g_timer_config[timer_id].toggle_pin.port = NULL;
    g_timer_config[timer_id].toggle_pin.pin = 0;
    g_timer_config[timer_id].toggle_pin.count = 0;
    g_timer_config[timer_id].toggle_pin.state = 0;
  }
}

/**
  * @brief  Get the counter value.
  * @param  timer_id : id of the timer
  * @retval Counter value
  */
uint32_t getTimerCounter(timer_id_e timer_id)
{
  if(timer_id < NB_TIMER_MANAGED)
    return __HAL_TIM_GET_COUNTER(&g_TimerHandle[timer_id]);
  else
    return 0;
}

/**
  * @brief  Set the counter value.
  * @param  timer_id : id of the timer
  * @param  value : counter value
  * @retval None
  */
void setTimerCounter(timer_id_e timer_id, uint32_t value)
{
  if(timer_id < NB_TIMER_MANAGED)
    __HAL_TIM_SET_COUNTER(&g_TimerHandle[timer_id], value);
}

/**
  * @brief  Set the TIM Capture Compare Register value.
  * @param  timer_id : id of the timer
  * @param  channel : TIM Channels to be configured.
  * @param  value : register new register.
  * @retval None
  */
void setCCRRegister(timer_id_e timer_id, uint32_t channel, uint32_t value)
{
  if(timer_id < NB_TIMER_MANAGED) {
    __HAL_TIM_SET_COMPARE(&g_TimerHandle[timer_id], channel*4, value);
  }
}

/**
  * @brief  Set the TIM Capture Compare Register value.
  * @param  timer_id : id of the timer
  * @param  channel : TIM Channels to be configured.
  * @retval CRR value.
  */
uint32_t getCCRRegister(timer_id_e timer_id, uint32_t channel)
{
  if(timer_id < NB_TIMER_MANAGED)
    return __HAL_TIM_GET_COMPARE(&g_TimerHandle[timer_id], channel);
  else
    return 0;
}

/**
  * @brief  Attached an interrupt handler
  * @param  timer_id : id of the timer
  * @param  irqHandle : interrupt handler
  * @retval none
  */
void attachIntHandle(timer_id_e timer_id, void (*irqHandle)(timer_id_e))
{
  if(timer_id < NB_TIMER_MANAGED)
    g_timer_config[timer_id].irqHandle = irqHandle;
}


/******************************************************************************/
/*                            TIMx IRQ HANDLER                                */
/******************************************************************************/

/**
  * @brief  TIM1 & TIM16 irq handler
  * @param  None
  * @retval None
  */
void TIM1_UP_TIM16_IRQHandler(void)
{
  HAL_TIM_IRQHandler(&g_TimerHandle[TIM1_E]);
  HAL_TIM_IRQHandler(&g_TimerHandle[TIM16_E]);
}

void TIM1_CC_IRQHandler(void)
{
  HAL_TIM_IRQHandler(&g_TimerHandle[TIM1_E]);
}

/**
  * @brief  TIM2 irq handler
  * @param  None
  * @retval None
  */
void TIM2_IRQHandler(void)
{
  HAL_TIM_IRQHandler(&g_TimerHandle[TIM2_E]);
}

/**
  * @brief  TIM3 irq handler
  * @param  None
  * @retval None
  */
void TIM3_IRQHandler(void)
{
  HAL_TIM_IRQHandler(&g_TimerHandle[TIM3_E]);
}

/**
  * @brief  TIM4 irq handler
  * @param  None
  * @retval None
  */
void TIM4_IRQHandler(void)
{
  HAL_TIM_IRQHandler(&g_TimerHandle[TIM4_E]);
}

/**
  * @brief  TIM5 irq handler
  * @param  None
  * @retval None
  */
void TIM5_IRQHandler(void)
{
  HAL_TIM_IRQHandler(&g_TimerHandle[TIM5_E]);
}

/**
  * @brief  TIM6 irq handler
  * @param  None
  * @retval None
  */
void TIM6_DAC_IRQHandler(void)
{
  HAL_TIM_IRQHandler(&g_TimerHandle[TIM6_E]);
}

/**
  * @brief  TIM7 irq handler
  * @param  None
  * @retval None
  */
void TIM7_IRQHandler(void)
{
  HAL_TIM_IRQHandler(&g_TimerHandle[TIM7_E]);
}

/**
  * @brief  TIM8 irq handler
  * @param  None
  * @retval None
  */
void TIM8_UP_IRQHandler(void)
{
  HAL_TIM_IRQHandler(&g_TimerHandle[TIM8_E]);
}

/**
  * @brief  TIM15 irq handler
  * @param  None
  * @retval None
  */
void TIM1_BRK_TIM15_IRQHandler(void)
{
  HAL_TIM_IRQHandler(&g_TimerHandle[TIM15_E]);
}

/**
  * @brief  TIM17 irq handler
  * @param  None
  * @retval None
  */
void TIM1_TRG_COM_TIM17_IRQHandler(void)
{
  HAL_TIM_IRQHandler(&g_TimerHandle[TIM17_E]);
}


/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
#ifdef __cplusplus
}
#endif

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
